a = 1
print('a =', a)
# 任何數，往左移2位元，相當於乘上 a ** 2
print('a << 2 =', a << 2)
# 任何數，往左移3位元，相當於乘上 a ** 3
print('a << 3 =', a << 3)
# 任何數，往左移4位元，相當於乘上 a ** 4
print('a << 4 =', a << 4)

a = 128
print('a =', a)
# 任何數，往右移2位元，相當於除以 a ** 2 (整數除法)
print('a >> 2 =', a >> 2)
# 任何數，往右移3位元，相當於除以 a ** 3 (整數除法)
print('a >> 3 =', a >> 3)
# 任何數，往右移4位元，相當於除以 a ** 4 (整數除法)
print('a >> 4 =', a >> 4)
# 任何數，往右移7位元，相當於除以 a ** 7 (整數除法)
print('a >> 7 =', a >> 7)
# 任何數，往右移8位元，相當於除以 a ** 8 (整數除法)
print('a >> 8 =', a >> 8)